import random

############
# Roulette #
############

순서 = ['( ´ิ(ꈊ) ´ิ) 1등!', 2, 3]

제목1 = ['서울에서 김서방 찾기', '문자열을 정수로 바꾸기', '이상한 문자 만들기', '2016년', '두 정수 사이의 합', '문자열 내림차순으로 배치하기']
제목2 = ['데이터베이스의 기본', 'ERD와 정규화 과정', '트랜잭션과 무결성']

뽑기 = ['( σ̴̶̷ .̫ σ̴̶̷ )♡ 당첨 ৻( •̀ ᗜ •́ ৻)', '꽝', '꽝', '꽝', '꽝', '꽝']


problems = random.sample([0, 1, 2], 3)
people = random.sample(['김성준', '이강윤', '유덕균'], 3)

### 함수 ###
# def rnd():
#     people = random.sample(['김성준', '김진호', '박승재', '오태훈', '이가은', '허정범'], 6)
#     problems = random.sample([0, 1, 2, 3, 4, 5], 6)


### 로직 ###
# while True:
#     print(
#         '''##################################################
# 1. 순서 정하기
# 2. 뽑기
# ##################################################'''
#     )
#     print('모드를 선택하세요. :', end=' ')
#     answer = int(input())
#     if answer == 1:
#         pass
#     else:
#         print('다시 눌러주세요')


### 출력단 ###
print('#' * 50)
for i in range(3):
    print(f'{people[i]} : {제목2[problems[i]]}')
print('#' * 50)